In [ ]:
#Problem statement - Combining DataFrame - I

In [1]:
import pandas as pd

In [33]:
d = {
    "name": ["karan","atish","veer"],
    "age" : [23,21,22]}

In [34]:
df= pd.DataFrame(d)

In [35]:
df

    name  age
0  karan   23
1  atish   21
2   veer   22

In [36]:
e = {
    "name": ["param","ashish","veer"],
    "age": [25,26,22]}

In [37]:
df1 = pd.DataFrame(e)

In [38]:
df1

     name  age
0   param   25
1  ashish   26
2    veer   22

In [44]:
df2 = pd.concat([df,df1]).drop_duplicates()
df2=df2.reset_index(drop=True)

In [45]:
df2

     name  age
0   karan   23
1   atish   21
2    veer   22
3   param   25
4  ashish   26

In [ ]:
#Problem statement - Combining DataFrame - II

In [46]:
d = {
    "employee": ["arun","atish","param","varun"],
    "department":["finance","accounting","engineering","engineering"]}

In [47]:
df = pd.DataFrame(d)

In [48]:
r = {
     "employee": ["arun","atish","param","varun"],
    "joining date": [2004,2005,2004,2001]}

In [49]:
df1 = pd.DataFrame(r)

In [50]:
df2 = pd.merge(df,df1)
df2

  employee   department  joining date
0     arun      finance          2004
1    atish   accounting          2005
2    param  engineering          2004
3    varun  engineering          2001

In [55]:
df3 =df2[df2["department"]=="engineering"]

In [56]:
df3

  employee   department  joining date
2    param  engineering          2004
3    varun  engineering          2001